DuinOS/Arduino/hardware/duinos/duinos/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################
uno_DuinOS.name=Arduino Uno + DuinOS
uno_DuinOS.upload.tool=avrdude
uno_DuinOS.upload.protocol=arduino
uno_DuinOS.upload.maximum_size=32256
uno_DuinOS.upload.speed=115200

uno_DuinOS.bootloader.tool=avrdude
uno_DuinOS.bootloader.low_fuses=0xFF
uno_DuinOS.bootloader.high_fuses=0xDE
uno_DuinOS.bootloader.extended_fuses=0x05
uno_DuinOS.bootloader.unlock_bits=0x3F
uno_DuinOS.bootloader.lock_bits=0x0F
uno_DuinOS.bootloader.file=optiboot/optiboot_atmega328.hex

uno_DuinOS.build.mcu=atmega328p
uno_DuinOS.build.f_cpu=16000000L
uno_DuinOS.build.core=arduino.duinos.avr
uno_DuinOS.build.variant=arduino:avr:standard

##############################################################
mega2560_DuinOS.name=Arduino Mega 2560 or Mega ADK + DuinOS

mega2560_DuinOS.upload.tool=avrdude
mega2560_DuinOS.upload.protocol=wiring
mega2560_DuinOS.upload.maximum_size=258048
mega2560_DuinOS.upload.speed=115200

mega2560_DuinOS.bootloader.tool=avrdude
mega2560_DuinOS.bootloader.low_fuses=0xFF
mega2560_DuinOS.bootloader.high_fuses=0xD8
mega2560_DuinOS.bootloader.extended_fuses=0xFD
mega2560_DuinOS.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex
mega2560_DuinOS.bootloader.unlock_bits=0x3F
mega2560_DuinOS.bootloader.lock_bits=0x0F

mega2560_DuinOS.build.mcu=atmega2560
mega2560_DuinOS.build.f_cpu=16000000L
mega2560_DuinOS.build.core=arduino.duinos.avr
mega2560_DuinOS.build.variant=arduino:avr:mega

##############################################################
mega_DuinOS.name=Arduino Mega (ATmega1280) + DuinOS

mega_DuinOS.upload.tool=avrdude
mega_DuinOS.upload.protocol=arduino
mega_DuinOS.upload.maximum_size=126976
mega_DuinOS.upload.speed=57600

mega_DuinOS.bootloader.tool=avrdude
mega_DuinOS.bootloader.low_fuses=0xFF
mega_DuinOS.bootloader.high_fuses=0xDA
mega_DuinOS.bootloader.extended_fuses=0xF5
mega_DuinOS.bootloader.file=atmega/ATmegaBOOT_168_atmega1280.hex
mega_DuinOS.bootloader.unlock_bits=0x3F
mega_DuinOS.bootloader.lock_bits=0x0F

mega_DuinOS.build.mcu=atmega1280
mega_DuinOS.build.f_cpu=16000000L
mega_DuinOS.build.core=arduino.duinos.avr
mega_DuinOS.build.variant=arduino:avr:mega

##############################################################

####
# Sanguino
############################################################

atmega644_duinos.name=Sanguino W/ ATmega644P

atmega644_duinos.upload.protocol=stk500
atmega644_duinos.upload.maximum_size=63488
atmega644_duinos.upload.speed=57600

atmega644_duinos.bootloader.low_fuses=0xFF
atmega644_duinos.bootloader.high_fuses=0x9A
atmega644_duinos.bootloader.extended_fuses=0xFF
atmega644_duinos.bootloader.path=atmega
atmega644_duinos.bootloader.file=ATmegaBOOT_168_atmega644p.hex
#atmega644_duinos.bootloader.file=ATmegaBOOT_644P.hex
atmega644_duinos.bootloader.unlock_bits=0x3F
atmega644_duinos.bootloader.lock_bits=0x0F

atmega644_duinos.build.mcu=atmega644p
atmega644_duinos.build.f_cpu=16000000L
atmega644_duinos.build.core=arduino.duinos.avr
atmega644_duinos.build.variant=sanguino:sanguino:standard
##############################################################

atmega12848m_duinos.name=Sanguino W/ ATmega1284p 8mhz

atmega12848m_duinos.upload.protocol=stk500
atmega12848m_duinos.upload.maximum_size=131072
atmega12848m_duinos.upload.speed=19200

atmega12848m_duinos.bootloader.low_fuses=0xFD
atmega12848m_duinos.bootloader.high_fuses=0x9A
atmega12848m_duinos.bootloader.extended_fuses=0xFF
atmega12848m_duinos.bootloader.path=atmega
atmega12848m_duinos.bootloader.file=ATmegaBOOT_168_atmega1284p_8m.hex
atmega12848m_duinos.bootloader.unlock_bits=0x3F
atmega12848m_duinos.bootloader.lock_bits=0x0F

atmega12848m_duinos.build.mcu=atmega1284p
atmega12848m_duinos.build.f_cpu=8000000L
atmega12848m_duinos.build.core=arduino.duinos.avr
atmega12848m_duinos.build.variant=sanguino:sanguino:standard

##############################################################

atmega1284_duinos.name=Sanguino W/ ATmega1284p 16mhz

atmega1284_duinos.upload.protocol=stk500
atmega1284_duinos.upload.maximum_size=131072
atmega1284_duinos.upload.speed=57600

atmega1284_duinos.bootloader.low_fuses=0xFF
atmega1284_duinos.bootloader.high_fuses=0x9A
atmega1284_duinos.bootloader.extended_fuses=0xFF
atmega1284_duinos.bootloader.path=atmega
atmega1284_duinos.bootloader.file=ATmegaBOOT_168_atmega1284p.hex
atmega1284_duinos.bootloader.unlock_bits=0x3F
atmega1284_duinos.bootloader.lock_bits=0x0F

atmega1284_duinos.build.mcu=atmega1284p
atmega1284_duinos.build.f_cpu=16000000L
atmega1284_duinos.build.core=arduino.duinos.avr
atmega1284_duinos.build.variant=sanguino:sanguino:standard
#
